[{"name": "Frita Batidos", "reviews": ["One of the best places to get burgers in Ann Arbor! Opens late so you can stop by after a long day. My favorite has to be the hibiscus Batidos, a bit sweet,...", "on first look, the man at the counter didn't give me a birthday churro, after we asked for said churro we received it. if you come here on you birthday do...", "What can I say about Frita's. If my Yelp check-in count is correct, I have eaten here 43 times (over the past 8 years). Frita's has (in my very scientific..."]}, {"name": "Zingerman's Delicatessen", "reviews": ["First off, this place is delicious! Sometimes the line can be ungodly long, however, it is well worth the wait. The staff is delightful and efficient. The...", "I mean, obviously this place is 5 stars. Best deli in the Midwest, amazing delivery options (got my daughter's 19th birthday cake delivered to her at...", "We were here a while back, since my brother likes their sandwiches, pastrami mostly. I don't eat beef so Turkey it is for me. \n\nMy husband and I tried their..."]}, {"name": "Mani Osteria & Bar", "reviews": ["I've been wanting to check out Mani for a while because of the pedigree (it's sister restaurant Isalita, is good too).  Finally got the chance and it didn't...", "I'm born and raised in New Jersey and I lived in Rome, so I have pretty high standards when it comes to Italian food. That being said, I thought Mani was a...", "I read great reviews on Yelp and the pictures looked great so my friends and I decided to come here to eat on a Saturday night. I was hoping the experience..."]}, {"name": "Sava's", "reviews": ["Sava's is a must if you're in downtown Ann Arbor! I've been here a few times and it never disappoints me. If you're looking for a restaurant to go on a...", "I am so happy I found Sava's on Yelp and Trip Advisor. This is definitely going to be the go-to restaurant for me whenever I'm in town visiting my son at...", "Sava's is clearly popular, but I have to say that I think it is overrated. Overall it was probably 3.5 stars for the food but I rounded down since we got..."]}, {"name": "Blank Slate Creamery", "reviews": ["First things first, if you haven't been to Blank Slate in Ann Arbor then you're missing out!\n\nSo I've been here a few times and it's always a hit. If you've...", "What a delightful treat! Popped by here on a warm Saturday afternoon in Sept and not surprisingly the line was out the door. It moved fairly quickly and...", "Their lavender lemon honey is sooo good. I love lavender ice cream flavors and this was super good. For those of you who say lavender anything tastes like..."]}, {"name": "Jolly Pumpkin Cafe & Brewery", "reviews": ["Beer? Wonderful. Come here for drinks and nice ambiance.\nFood? Wack. That tofu bibimbap sandwich....the tofu wasn't really well flavored. The truffle fries...", "This place is pretty reliable. Emphasis on reliable. They've got an array of beer options and a smaller cocktail option. \n\nA few times I've been they were...", "What a bummer of a dinner plan. We swung through Ann Arbor on our way to northern Michigan for a night and were excited to grab a bite to eat here. Upon..."]}, {"name": "Aventura", "reviews": ["We had reservations for four for a going away dinner. Our waitress was very friendly and knowledgeable about the menu, which is divided into four sections:...", "Pre-covid this used to be my go to spot for happy hour. They had amazing sangria fro $5 dollars and discount on some of their tapas. Before covid I would...", "Came here on a Saturday early evening. The noise level is a little higher than some places but you could still have a good conversation. Tables were..."]}, {"name": "Zingerman's Roadhouse", "reviews": ["Wait time was about a half hour but we had a party of 7. \n\nEggnog latte was really good. Glad I got it.\n\nMy daughter got the 4oz steak and mashed potatoes...", "Came here when I wanted some comfort food. I wanted fried chicken and mac and cheese. I was ecstatic to see there was a fried chicken mac and cheese option,...", "This review is based on the fact that the menu clearly identifies what is gluten free or adaptable to be gluten free. I drove over an hour for brunch and..."]}, {"name": "Juicy Kitchen", "reviews": ["Great smoothies and breakfast! My daughter and I shared BLT omelette and Spanish chocolate smoothy. Take out service only. Also nice menu of coffee choices.", "Gluten-free, vegan, and vegetarians look no further!!! This healthy breakfast cafe offers so many yummy options for all diets. For being a smaller...", "I've written it in other reviews but one of the things I miss most about dining out is breakfast and brunch. A hearty plate of eggs, pancakes, and..."]}, {"name": "TeaHaus", "reviews": ["TeaHaus is a fantastic spot. Their macarons are very tasty, their tea selection is expansive, and they have great tea items and mugs. During the pandemic...", "FYI--the last weekend of every month they offer carryout high tea for $35 per service. It's AMAZING and it's so nice to get all my faves from the tea...", "Such a cute place to catch up with friends or study. The food is quite pricey and sometimes doesn't warrant the cost, but the daintiness of it all certainly..."]}, {"name": "Tomukun Noodle Bar", "reviews": ["This place is great. I gave them 4 stars because their communication isn't too good with each other. The other night the kitchen closed earlier than usual...", "I am trying to post reviews not just for places I'm in love with. Therefore, I must be completely honest and say that I wished this place focused more on...", "I had leveled my expectations going in, because let's be honest, one look at the menu and anyone can tell that it's not going to be authentic.\n\nThere are..."]}, {"name": "Pacific Rim", "reviews": ["Savory Pan Asian!\n\nWhen the waiter tells you the tuna arrived that morning, it's a no brainer what to order.  @pacificrim_a2 definitely delivered during our...", "Went on a date on a Tuesday night. The gentleman who sat us was very friendly and nice. The decor is elegant, and they even have a room they can block out...", "Place:\nThis place is on main street. This place is definitely bring your parents for college students or on a special occasion. The place has some asian..."]}, {"name": "Monahan's Seafood Market", "reviews": ["Their fish and chips is incredible. The fish is mild and moist, and the breading stays crisp even through the fifteen minute drive home. The tartar sauce is...", "I stopped in late on Friday (1:45 pm) after getting off the train. Hungry, I stopped by the area knowing I could find options. Even though it's past the...", "Are you a seafood fanatic? Then get yourself to Monahan's. Are you a HARDCORE seafood fanatic? Then head to their website and sign up for the \"Friday Fish..."]}, {"name": "RoosRoast Coffee", "reviews": ["Good service nice sitting area outside social distancing. Street parking in front and parking in the rear. The area is very quiet. They have umbrellas to...", "I really do love this charming neighborhood coffee spot. They are doing the best they can in spite of this dreadfully prolonged pandemic. And their flavored...", "Best coffee shop in Ann Arbor! Not only the coffee is fantastic but friendly baristas! Cozy indoor decoration, social distance and nice outdoor seating...."]}, {"name": "Isalita", "reviews": ["Great food and the drinks are amazing ! The staff also is really helpful guiding you to the tastiest experience.", "First things first, the vibe here is incredible! We got seated immediately, I came with my mom :). \n\nHe music + decor is really nice, I enjoyed it a...", "We enjoyed sitting outside and eating tacos and guac while on a vist to the University of Michigan. \n\nIt was easy to walk to from campus, and we didn't have..."]}, {"name": "The Songbird Cafe", "reviews": ["I lived in Ann Arbor for six years and this place has got to be one of my favorites. It's definitely a bit more expensive, but their sandwiches are unique...", "I got to say, we came here 2x in a row and both days everything was really very good and very fresh. \nFirst day- egg and cheese, it was delish and brioche...", "My favorite go-to place for brunch when I am in the area for work. I usually get the same thing: omelet with bacon, smoked gouda, and spinach. So good and..."]}, {"name": "Biercamp", "reviews": ["Excellent food and very friendly staff. I ordered the brisket sandwich and it was phenomenal! The meat was very flavorful and the toppings complement the...", "It had been a while since we visited Biercamp but when a friend asked for recommendation on good encased meats in the area it got me craving them! We got...", "Heaven is a place on earth and it's Biercamp. This place is so low key And High Quality and i dare you not to fall in love. \n\nVienna IPA w/ a Philly Brat &..."]}, {"name": "Tmaz Taqueria", "reviews": ["This place is legit. They have a lot of genuine Mexican dishes, and don't feel like they cut corners. They're getting their dining space improved steadily,...", "I went here a couple of years ago so my review isn't as valid as others, I will admit it. The food was decent but I will say that it was kind of dry. The...", "This place changed my life. All the tacos and pupusas are amazing. So many options and definitely the best vegetarian tacos I've had. Staff is also so nice!..."]}, {"name": "Chela's", "reviews": ["LOVE their taco take-out box for the price its a great value and we always end up with some leftovers (hooray!) \n\nThis is authentic as it gets. The meats...", "Very good Mexican fast food. I always get the loaded burrito Al Pastor.  It has all the flavors and textures I feel are needed for this particular item....", "Prompt service with three guys assembling the orders, which makes it a great place for take out.  Large patio but rathy sunny during the lunch hour.  The..."]}, {"name": "Poke Fish", "reviews": ["Really, really good poke. I'm from California and I tend to assume that the best poke comes from states closer to the coast, but Poke Fish definitely...", "I was honestly surprised by how fresh the fish and ingredients were! \n\nWe got the Salmon Lover (left in picture) and Volcano Bowl (right). Let me first say...", "I entered the empty restaurant at 3ish on a  Tuesday afternoon. The staff or owners seemed very kind. I was kindly greeted by a lady. I asked, \" What are..."]}]